app/Controllers/Anggota.php

SELECT *
FROM `anggota`
---
    public function index()
    {
        $data['anggota'] = $this->anggotaModel->findAll();