app/Controllers/Auth.php

    public function process()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (!$username || !$password) {
            $this->session->setFlashdata('error', 'Username dan password harus diisi.');
            return redirect()->back()->withInput();
        }

        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1