app/Controllers/Dashboard.php

    public function index()
    {
        // =========================
        // VALIDASI LOGIN
        // =========================
        if (!session()->get('role')) {
            return redirect()->to('/login');
        }

        $role = session()->get('role');

        // =========================
        // STATISTIK UTAMA
        // =========================
        $dataBuku    = $this->bukuModel->countAll();
        $dataAnggota = $this->anggotaModel->countAll();
        $dataPinjam  = $this->peminjamanModel->countAll();

        // 🔥 TOTAL PENGEMBALIAN
        $dataKembali = $this->peminjamanModel
            ->where('status', 'kembali')
            ->countAllResults();

        // =========================
        // CHART BULANAN (6 BULAN)
        // =========================
        $chartBulanan = $this->peminjamanModel
            ->select("MONTH(tanggal_pinjam) as bulan, COUNT(*) as total")
            ->where("tanggal_pinjam >=", date('Y-m-01', strtotime('-5 months')))
            ->groupBy("MONTH(tanggal_pinjam)")
            ->orderBy("MONTH(tanggal_pinjam)", "ASC")
            ->findAll();

        // =========================
        // CHART JENIS BUKU
        // =========================
        $chartJenis = $this->bukuModel
            ->select("jenis, COUNT(*) as total")
            ->groupBy("jenis")
            ->findAll();

        // =========================
        // CHART STATUS (BARU 🔥)
        // =========================
        $chartStatus = $this->peminjamanModel
            ->select("status, COUNT(*) as total")
            ->groupBy("status")
            ->findAll();

        // =========================
        // KALENDER PINJAM
        // =========================
        $tanggalPinjam = $this->peminjamanModel
            ->select("DAY(tanggal_pinjam) as hari")
            ->where("MONTH(tanggal_pinjam)", date('m'))
            ->findAll();

        // =========================
        // KALENDER KEMBALI (BARU 🔥)
        // =========================
        $tanggalKembali = $this->peminjamanModel
            ->select("DAY(tanggal_kembali) as hari")
            ->where("tanggal_kembali IS NOT NULL")
            ->where("MONTH(tanggal_kembali)", date('m'))
            ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'kembali'
SELECT MONTH(tanggal_pinjam) as bulan, COUNT(*) as total
FROM `peminjaman`
WHERE `tanggal_pinjam` >= '2025-11-01'
GROUP BY MONTH(tanggal_pinjam)
ORDER BY MONTH(tanggal_pinjam) ASC
SELECT `jenis`, COUNT(*) as total
FROM `buku`
GROUP BY `jenis`
SELECT `status`, COUNT(*) as total
FROM `peminjaman`
GROUP BY `status`
SELECT DAY(tanggal_pinjam) as hari
FROM `peminjaman`
WHERE MONTH(tanggal_pinjam) = '04'
SELECT DAY(tanggal_kembali) as hari
FROM `peminjaman`
WHERE `tanggal_kembali` IS NOT NULL
AND MONTH(tanggal_kembali) = '04'